/*
 * keyboard.cpp
 *
 *  Created on: 01.05.2012
 *      Author: Хозяин
 */

#include "keyboard.h"

static uint16_t s_keys = 0x0000;  ///< состояние кнопок


/**
 * *****************************************************************************
 *
 * @brief Возвращает значение нажатой кнопки.
 * @return Код нажатой кнопки
 *
 * *****************************************************************************
 */
uint16_t eKEYget(void)
{
    return s_keys;
}


/**
 * *****************************************************************************
 *
 * @brief Цикл опроса клавиатуры.
 *
 * Вызывать надо раз в 10мс
 *
 * *****************************************************************************
 */
void vKEYmain(void)
{
    uint16_t keys = 0;
    uint8_t  pinc = PINC;
    uint8_t  pind = PIND;
    uint8_t  ping = PING;

    keys |= (pind & 0x80) ? (0x0000) : (0x0001);
    keys |= (ping & 0x02) ? (0x0000) : (0x0002);
    keys |= (pinc & 0x01) ? (0x0000) : (0x0004);
    keys |= (ping & 0x01) ? (0x0000) : (0x0008);
    keys |= (pinc & 0x02) ? (0x0000) : (0x0010);
    keys |= (pinc & 0x04) ? (0x0000) : (0x0020);
    keys |= (pind & 0x40) ? (0x0000) : (0x0040);
    keys |= (pinc & 0x08) ? (0x0000) : (0x0080);
    keys |= (pinc & 0x10) ? (0x0000) : (0x0100);

    s_keys = keys;
}

/* ******************************** E N D *********************************** */
