/*
 * keyboard.cpp
 *
 *  Created on: 01.05.2012
 *      Author: Хозяин
 */

#include "keyboard.h"

static uint16_t s_keys = 0x01FF;  ///< состояние кнопок
static uint16_t s_mask = 0xFFFF;  ///< маска кнопок


/**
 * *****************************************************************************
 *
 * @brief Возвращает значение нажатой кнопки.
 * @return Код нажатой кнопки
 *
 * *****************************************************************************
 */
uint16_t eKEYget(void)
{
    return ~(s_keys | s_mask);
}


/**
 * *****************************************************************************
 *
 * @brief Цикл опроса клавиатуры.
 *
 * Вызывать надо раз в 10мс
 *
 * *****************************************************************************
 */
void vKEYmain(void)
{
    uint16_t keys = 0xFE00;

    keys |= static_cast<uint16_t>(PIND & 0xC0) >> 6;
    keys |= static_cast<uint16_t>(PING & 0x03) << 2;
    keys |= static_cast<uint16_t>(PINC & 0x1F) << 4;

    s_mask = s_keys ^ keys;
    s_keys = keys;
}

/* ******************************** E N D *********************************** */
