#include "gtest/gtest.h"
#include <cstdio>
#include <iostream>

using namespace std;

#include "PIg/src/flash.h"

// размер массива
#define SIZE_ARRAY(arr) (sizeof(arr) / sizeof(arr[0]))

class Flash_Test : public ::testing::Test
{
public:
    Flash_Test() { }
    virtual ~Flash_Test() override = default;
};

//
TEST_F(Flash_Test, fcJrnEventK400)
{
    std::vector<string> events = {
        "Событие - 0",           ///< 0 - ошибочное значение
        "Вкл. питания/перезап",  ///< 1
        "Выключение питания",    ///< 2
        "Изменение режима раб",  ///< 3
        "Изменение параметров",  ///< 4
        "Неиспр теста ПРД",      ///< 5
        "Неиспр теста ПРМ",      ///< 6
        "Событие - 7",           ///< 7
        "Неиспр блока БСК",      ///< 8
        "Изменение дата/время",  ///< 9
        "Событие - 10",          ///< 10
        "Событие - 11",          ///< 11
        "Событие - 12",          ///< 12
        "Авария по D",           ///< 13
        "Предупреждение по D",   ///< 14
        "Неиспр чтения команд",  ///< 15
        "Восстановление D",      ///< 16
        "Неиспр. работы DSP",    ///< 17
        "Восстан-е работы DSP",  ///< 18
        "Низкое напр. выхода",   ///< 19
        "Высокое напр. выхода",  ///< 20
        "Нет КЧ 5 сек на %s",    ///< 21
        "Нет КЧ на %s",          ///< 22
        "Восстан-е КЧ на %s",    ///< 23
        "Восст.ур. КЧ на %s",    ///< 24
        "Неиспр чт/зап 2RAM",    ///< 25
        "Неиспр чт/зап ПЛИС",    ///< 26
        "Неиспр чт/зап FLASH",   ///< 27
        "Неисправность часов",   ///< 28
        "Сниж.ур. КЧ на %s",     ///< 29
        "Ошибка работы ЦП",      ///< 30
        "Вход RX ЦП пуст",       ///< 31
        "Работа ЦП восстановл",  ///< 32
        "Высокая температура",   ///< 33
        "Низкая температура",    ///< 34
        "Нормал. температура",   ///< 35
        "Неиспр.датчик темпер",  ///< 36
        "Исправ.датчик темпер",  ///< 37
        "Событие - %d",          ///< 38
        "Событие - %d",          ///< 39
        "Событие - %d",          ///< 40
        "Событие - %d"           ///< ошибочное значение
    };

    for (size_t i = 0; i < events.size(); i++)
    {
        ASSERT_STREQ(events.at(i).c_str(), fcJrnEventK400[i]);
    }
}

//
TEST_F(Flash_Test, fcJrnEventRZSK)
{
    vector<string> events = {
        "Событие - %d",          ///< 0 - ошибочное значение
        "Вкл. питания/перезап",  ///< 1
        "Выключение питания",    ///< 2
        "Изменение режима раб",  ///< 3
        "Удаленный неисправен",  ///< 4
        "Неиспр теста ПРД",      ///< 5
        "Неиспр теста ПРМ",      ///< 6
        "Неиспр блока БСЗ",      ///< 7
        "Неиспр блока БСК",      ///< 8
        "Неиспр перекл-ей БСЗ",  ///< 9
        "Нет сигнала манипул.",  ///< 10
        "Неиспр выходной цепи",  ///< 11
        "Нет РЗ 5 сек на %s",    ///< 12
        "Отсут-е сигнала Пуск",  ///< 13
        "Отсут-е сигнала Стоп",  ///< 14
        "Неиспр чтения команд",  ///< 15
        "Сниж. ур. КЧ на %s",    ///< 16
        "Неиспр. работы DSP",    ///< 17
        "Восстан-е работы DSP",  ///< 18
        "Низкое напр. выхода",   ///< 19
        "Высокое напр. выхода",  ///< 20
        "Нет КЧ 5 сек на %s",    ///< 21
        "Нет КЧ на %s",          ///< 22
        "Восстан-е КЧ на %s",    ///< 23
        "Восст. ур.КЧ на %s",    ///< 24
        "Неиспр чт/зап 2RAM",    ///< 25
        "Неиспр чт/зап ПЛИС",    ///< 26
        "Неиспр чт/зап FLASH",   ///< 27
        "Неисправность часов",   ///< 28
        "Сниж. ур. РЗ на %s",    ///< 29
        "Восстан-е РЗ на %s",    ///< 30
        "Нет РЗ на %s",          ///< 31
        "Восст. ур.РЗ на %s",    ///< 32
        "Изменение параметров",  ///< 33
        "Изменение дата/время",  ///< 34
        "Прием РЗ в одностор.",  ///< 35
        "Нет РЗ в одностор.",    ///< 36
        "ВЧ тракт восстановл.",  ///< 37
        "Вкл. одностор. режим",  ///< 38
        "Выкл одностор. режим",  ///< 39
        "Сброс ВЧ тракт восст",  ///< 40
        "Событие - %d"           ///< ошибочное значение
    };

    for (size_t i = 0; i < events.size(); i++)
    {
        ASSERT_STREQ(events.at(i).c_str(), fcJrnEventRZSK[i]);
    }
}

//
TEST_F(Flash_Test, fcJrnEventR400_MSK)
{
    vector<string> events = {
        "Событие - 0",           ///< 0 - ошибочное значение
        "Неиспр чт/зап FLASH",   ///< 1
        "ВЧ тракт восстановл.",  ///< 2
        "Неиспр чт/зап ПЛИС",    ///< 3
        "Автоконтроль",          ///< 4
        "Ток покоя",             ///< 5
        "Неиспр чт/зап 2RAM",    ///< 6
        "Неиспр работы DSP",     ///< 7
        "Восстан-е работы DSP",  ///< 8
        "Низкое напр. выхода",   ///< 9
        "Высокое напр. выхода",  ///< 10
        "Нарушен обмен с УМ",    ///< 11
        "Неисправность часов",   ///< 12
        "Нет блока БСЗ",         ///< 13
        "Ошибка версии БСЗ",     ///< 14
        "Неиспр перекл-ей БСЗ",  ///< 15
        "Нет сигнала МАН",       ///< 16
        "Вкл.пит/Перезапуск",    ///< 17
        "Изменение режима",      ///< 18
        "Неиспр зап. вых.цепи",  ///< 19
        "Изменение параметров",  ///< 20
        "АК - Снижение запаса",  ///< 21
        "АК - Нет ответа",       ///< 22
        "Отсут-е сигнала Пуск",  ///< 23
        "Отсут-е сигн Останов",  ///< 24
        "Выключение аппарата",   ///< 25
        "Помеха в линии",        ///< 26
        "Неисправность ДФЗ",     ///< 27
        "Уд: АК - нет ответа",   ///< 28
        "Уд: Помеха в линии",    ///< 29
        "Уд: Неиспр. ДФЗ",       ///< 30
        "Уд: Неиспр. цепи вых",  ///< 31
        "Порог по помехе",       ///< 32
        "Изменение времени",     ///< 33
        "Часы",                  ///< 34
        "Помеха",                ///< 35
        "Дальний",               ///< 36
        "Сброс своего",          ///< 37
        "Сброс от удаленного",   ///< 38
        "Сброс АК",              ///< 39
        "Сброс АК по вх.упр.1",  ///< 40
        "Сброс АК от удален.",   ///< 41
        "Пуск АК"                ///< 42
    };

    ASSERT_LE(events.size(), MAX_JRN_EVENT_VALUE);
    ASSERT_EQ(events.size(), JRN_EVENT_R400M_SIZE);
    ASSERT_EQ(events.size(), SIZE_OF(fcJrnEventR400_MSK));

    for (size_t i = 0; i < events.size(); i++)
    {
        SCOPED_TRACE("i = " + to_string(i));

        ASSERT_STREQ(events.at(i).c_str(), fcJrnEventR400_MSK[i]);
    }
}

//
TEST_F(Flash_Test, fcJrnEventOPTO)
{
    vector<string> events = {
        "Событие - %d",          ///< 0 - ошибочное значение
        "Неиспр чт/зап FLASH",   ///< 1
        "Неиспр чт/зап 2RAM",    ///< 2
        "Неиспр чт/зап ПЛИС",    ///< 3
        "Событие - %d",          ///< 4
        "Неиспр теста ПРД",      ///< 5
        "Неиспр выкл.тест ПРД",  ///< 6
        "Неиспр теста ПРМ",      ///< 7
        "Неиспр чт.команд БСК",  ///< 8
        "Нет блока БСК",         ///< 9
        "Ошибка версии БСК",     ///< 10
        "Отказ резерв. линии",   ///< 11
        "Неисправность часов",   ///< 12
        "Нет блока БСЗ",         ///< 13
        "Ошибка версии БСЗ",     ///< 14
        "Неиспр перекл-ей БСЗ",  ///< 15
        "Нет сигнала МАН",       ///< 16
        "Вкл.пит/Перезапуск",    ///< 17
        "Изменение режима",      ///< 18
        "Неиспр цепи вых.",      ///< 19
        "Восстан-е КС на ПРМ",   ///< 20
        "Ошибка работы ЦП",      ///< 21
        "Восстан-е работы ЦП",   ///< 22
        "Отсут-е сигнала Пуск",  ///< 23
        "Отсут-е сигн Останов",  ///< 24
        "Выключение питания",    ///< 25
        "Нет КС",                ///< 26
        "Нет КС 5 секунд",       ///< 27
        "Уд: пост неисправен",   ///< 28
        "Уд: ПРД неисправен",    ///< 29
        "Уд: ПРМ неисправен",    ///< 30
        "Изменение дата/время",  ///< 31
        "Изменение параметров",  ///< 32
        "Событие - %d",          ///< 33
        "Событие - %d",          ///< 34
        "Событие - %d",          ///< 35
        "Событие - %d",          ///< 36
        "Событие - %d",          ///< 37
        "Событие - %d",          ///< 38
        "Событие - %d",          ///< 39
        "Событие - %d",          ///< 40
        "Событие - %d"           ///< ошибочное значение
    };

    for (size_t i = 0; i < events.size(); i++)
    {
        ASSERT_STREQ(events.at(i).c_str(), fcJrnEventOPTO[i]);
    }
}

//
TEST_F(Flash_Test, fcJrnEventOPTOring)
{
    vector<string> events = {
        "Событие - %d",          ///< 0 - ошибочное значение
        "Неиспр чт/зап FLASH",   ///< 1
        "Неиспр чт/зап 2RAM",    ///< 2
        "Неиспр чт/зап ПЛИС",    ///< 3
        "Кольцо нарушено",       ///< 4
        "Неиспр теста ПРД",      ///< 5
        "Неиспр выкл.тест ПРД",  ///< 6
        "Неиспр теста ПРМ",      ///< 7
        "Неиспр чт.команд БСК",  ///< 8
        "Нет блока БСК",         ///< 9
        "Ошибка версии БСК",     ///< 10
        "Отказ резерв. линии",   ///< 11
        "Неисправность часов",   ///< 12
        "Кольцо восстановлено",  ///< 13 кольцо
        "Дистанционный сброс",   ///< 14 кольцо
        "Команда не вернулась",  ///< 15 кольцо
        "Нет сигнала МАН",       ///< 16
        "Вкл.пит/Перезапуск",    ///< 17
        "Изменение режима",      ///< 18
        "Неиспр цепи вых.",      ///< 19
        "Восстан-е КС на ПРМ",   ///< 20
        "Восстан-е КС БЦК1",     ///< 21
        "Восстан-е КС БЦК2",     ///< 22
        "Нет КС БЦК1",           ///< 23
        "Нет КС БЦК2",           ///< 24
        "Выключение питания",    ///< 25
        "Нет КС",                ///< 26
        "Нет КС 5 секунд",       ///< 27
        "Уд: пост неисправен",   ///< 28
        "Уд: ПРД неисправен",    ///< 29
        "Уд: ПРМ неисправен",    ///< 30
        "Изменение дата/время",  ///< 31
        "Изменение параметров",  ///< 32
        "Событие - %d",          ///< 33
        "Событие - %d",          ///< 34
        "Событие - %d",          ///< 35
        "Событие - %d",          ///< 36
        "Событие - %d",          ///< 37
        "Событие - %d"           ///< ошибочное значение
    };

    for (size_t i = 0; i < events.size(); i++)
    {
        ASSERT_STREQ(events.at(i).c_str(), fcJrnEventOPTOring[i]);
    }
}
